In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
#print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
new_df=df.replace({'Ticket':'[A-Za-z0-9]*[A-Za-z]|[" "]*',
                  'Ticket':'[A-Za-z0-9]*[A-Za-z]|.*',
                  'Ticket':'[A-Za-z0-9]*[A-Za-z]|/*'},'',regex=True)

In [5]:
new_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
new_df=new_df.replace({
    'female':1,
     'male':0
})

In [7]:
new_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df1=new_df[['Survived','Pclass','Sex','Age','Parch']]

In [9]:
df1.tail()

     Survived  Pclass  Sex   Age  Parch
886         0       2    0  27.0      0
887         1       1    1  19.0      0
888         0       3    1   NaN      2
889         1       1    0  26.0      0
890         0       3    0  32.0      0

In [10]:
df1 = df1.dropna()

In [11]:
df1.tail()

     Survived  Pclass  Sex   Age  Parch
885         0       3    1  39.0      5
886         0       2    0  27.0      0
887         1       1    1  19.0      0
889         1       1    0  26.0      0
890         0       3    0  32.0      0

In [12]:
 df1=pd.DataFrame(df1,dtype='int32')

In [13]:
labels=df1['Survived']
labels[0:4]

0    0
1    1
2    1
3    1
Name: Survived, dtype: int32

In [14]:
col=df1.columns
data1=df1[col[1:]]

In [15]:
data1[0:10]

    Pclass  Sex  Age  Parch
0        3    0   22      0
1        1    1   38      0
2        3    1   26      0
3        1    1   35      0
4        3    0   35      0
6        1    0   54      0
7        3    0    2      1
8        3    1   27      2
9        2    1   14      0
10       3    1    4      1

In [24]:
from sklearn.linear_model import LogisticRegression

In [40]:
data11=np.array(data1,dtype='int32')
labels=np.array(labels,dtype='int32')
clf = LogisticRegression(random_state=0, solver='lbfgs').fit(data11, labels)

In [41]:
test=pd.read_csv("test.csv")

In [42]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [43]:
test=test[['PassengerId','Pclass','Sex','Age','Parch']]

In [44]:
test1=test.replace({
    'male':0,
    'female':1
})

In [45]:
test1.head()

   PassengerId  Pclass  Sex   Age  Parch
0          892       3    0  34.5      0
1          893       3    1  47.0      0
2          894       2    0  62.0      0
3          895       3    0  27.0      0
4          896       3    1  22.0      1

In [46]:
test1=test1.fillna(method="ffill")

In [47]:
col=test1.columns
test_data=test1[col[1:]]

In [48]:
test_data[0:10]

   Pclass  Sex   Age  Parch
0       3    0  34.5      0
1       3    1  47.0      0
2       2    0  62.0      0
3       3    0  27.0      0
4       3    1  22.0      1
5       3    0  14.0      0
6       3    1  30.0      0
7       2    0  26.0      1
8       3    1  18.0      0
9       3    0  21.0      0

In [49]:
pre=clf.predict(test_data)

In [50]:
pre[0:10]

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0], dtype=int32)

In [71]:
acc_val=pd.read_csv('gender_submission.csv')

In [72]:
acc_val.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [69]:
acc_val.Survived=pre

In [58]:
 from sklearn.metrics import accuracy_score

In [62]:
accuracy_score(acc_val.Survived,pre)

0.90669856459330145